app/controllers/now_playing_controller.rb

    def index

        lastRefresh = nil
        # The CurrentInfo table holds the song and listener data that was looked up the last
        # time the web service was called. last_refresh tell us how old it is.
        currentInfo = CurrentInfo.find(:first)
        if currentInfo != nil
            lastRefresh = currentInfo.last_refresh
        end
        logger.info "lastRefresh = #{lastRefresh}, 30 seconds ago was #{Time.now.ago(30)}"

        if lastRefresh == nil || lastRefresh < Time.now.ago(30)
            # The PlayInfo table has all song and listener data. Update CurrentInfo with the
            # last data saved to PlayInfo.
            playInfo = PlayInfo.find(:last)
            if playInfo == nil || playInfo.created_at < Time.now.ago(60)
                # If PlayInfo is out of date, something is probably wrong.
                message = "#{Time.new} Last entry in play info table is missing or over a minute old!"
                logger.warn message
                if playInfo != nil
                    logger.warn "playInfo.created_at = #{playInfo.created_at}"
                end
                if currentInfo.error_notified == false
                    ErrorMailer.deliver_error_email message
                    currentInfo.update_attribute('error_notified', true)
---
UPDATE "current_infos" SET "last_refresh" = '2010-04-20 01:06:22', "title" = 'Wild world', "year" = '2004', "artist" = 'Karrin Allyson', "updated_at" = '2010-04-20 01:06:22', "error_notified" = 'f' WHERE "id" = 1

                # I only need the separate mix name if there's a track ID, otherwise the icecast
                # title (which is the name of the mix) will be displayed.
                if mixId != nil && trackId != nil
                    mixInfo = Mix.find(:first, :conditions => {:mix_id => mixId})
---
SELECT * FROM "mixes" WHERE ("mixes"."mix_id" = 2) LIMIT 1

                    end
                else
                    logger.info "found play info track ID #{trackId}"
                    # The DisplayInfo table has extended song information such as long title, year, etc.
                    displayInfo = DisplayInfo.find(:first, :conditions => {:track_id => trackId})
---
SELECT * FROM "display_infos" WHERE ("display_infos"."track_id" = 7111) LIMIT 1

                if currentInfo != nil
                    currentInfo.update_attributes(updated)
                else
                    CurrentInfo.create(updated)
---
INSERT INTO "current_infos" ("artist", "updated_at", "title", "mix_icecast_title", "year", "listeners", "created_at") VALUES('Bent with Toni Tennille', '2010-04-10 01:08:55', 'Magic love', 'Between Two Islands - Summer mix 2006', '2003', 0, '2010-04-10 01:08:55')